# 6 зад. От първия ред на стандартния вход се въвежда цяло положително число n (n<=280), от втория ред на
# стандартния вход се въвеждат n на брой числа. На първия ред на стандартния изход да се отпечата най-голямото число, което е по-малко от 500. Ако няма число, което е по-малко от 500, да се отпечата NO


# От първия ред на стандартния вход се въвежда цяло положително число n
n = int(input())

# от втория ред на стандартния вход се въвеждат n на брой числа
num_str = input()
num_int_list = list(int(num) for num in num_str.split())
max_num = None

#  Намери числата < 500
numbers_less_then_500 = []
for num in num_int_list:
    if(num < 500):
        numbers_less_then_500.append(num)


# Намери най-голямото число, което е по-малко от 500
for num in numbers_less_then_500:
    max_num = max(numbers_less_then_500)

# На първия ред на стандартния изход да се отпечата най-голямото число, което е по-малко от 500. Ако няма число, което е по-малко от 500, да се отпечата NO
if max_num is not None:
  print(max_num)
else: 
    print('NO')




