# 11 зад. От първия ред на стандартния вход се въвежда цяло положително число n (n<=300), от втория ред
# на стандартния вход се въвеждат n на брой числа. Три числа са „приятели“, ако са разположени едно след
# друго и сумата на първото и третото е равна на второто. Например в последователността 6 96 90 135 45 80,
# „приятели“ са числата 6, 96, 90, и 90, 135, 45. На първия ред на стандартния изход да се отпечата броя на
# „приятелите“ във въведената последователност числа.
# Вход: 
# 11 
# 62 71 9 104 95 34 90 90 92 2 44
# Изход:
# 3


# От първия ред на стандартния вход се въвежда цяло положително число n
n = int(input())
# от втория ред на стандартния вход се въвеждат n на брой числа
num_str = input()
num_int_list = list(int(num) for num in num_str.split())

# Намиране на броя на "приятелите" 
friends_counter = 0
for i in range(2, len(num_int_list)):
    if num_int_list[i] + num_int_list[i - 2] == num_int_list[i - 1]:
        friends_counter += 1

# Отпечатване на броя на "приятелите" 
print(friends_counter)