# 7 зад. От първия ред на стандартния вход се въвежда цяло положително число n (n<=400), от втория ред на
# стандартния вход се въвеждат n на брой числа. На първия ред на стандартния изход да се отпечата най-малкото число, което е по-голямо от 50. Ако няма число, което е по-голямо от 50, да се отпечата NO

# От първия ред на стандартния вход се въвежда цяло положително число n
n = int(input())

# от втория ред на стандартния вход се въвеждат n на брой числа
num_str = input()
num_int_list = list(int(num) for num in num_str.split())
min_num = None

#  Намери числата > 50
numbers_more_then_50 = []
for num in num_int_list:
    if(num > 50):
        numbers_more_then_50.append(num)


# Намери най-малкото число, което е по-голямо от 50
for num in numbers_more_then_50:
    min_num = min(numbers_more_then_50)

# На първия ред на стандартния изход да се отпечата най-малкото число, което е по-голямо от 50. Ако няма число, което е по-голямо от 50, да се отпечата NO
if min_num is not None:
  print(min_num)
else: 
    print('NO')


