""" 
1 зад. От първия ред на стандартния вход се въвежда цяло положително число n (n<=400), от втория ред на
стандартния вход се въвеждат n на брой числа. На първия ред на стандартния изход да се отпечата първото
въведено число, което е по-голямо от 100 или NO, ако няма въведено такова число.
"""
# Въвеждане на брой числа
n = int(input())

# Инициализация на променлива, която ще съдържа първото число > 100
first_greater_than_100 = None

# Четене на числата и търсене на първото > 100
numbers = map(int, input().split())
for num in numbers:
    if num > 100:
        first_greater_than_100 = num
        break

# Извеждане на резултата
if first_greater_than_100 is not None:
    print(first_greater_than_100)
else:
    print("NO")
