# 10 зад. От първия ред на стандартния вход се въвежда цяло положително число n (n<=300), от втория ред
# на стандартния вход се въвеждат n на брой числа. Две числа са „близки“, ако са разположени едно след
# друго и първото е по-малко от второто. Например в последователността 6 3 90 100 45 80, „близки“ числа са
# 3 и 90, 90 и 100, 45 и 80. На първия ред на стандартния изход да се отпечата броя на „близките“ във
# въведената последователност числа.
# Вход: 
# 10 
# 62 56 90 7 95 34 90 90 43 2
# Изход:
# 3

# От първия ред на стандартния вход се въвежда цяло положително число n
n = int(input())

# от втория ред на стандартния вход се въвеждат n на брой числа
num_str = input()
num_int_list = list(int(num) for num in num_str.split())

# Намиране на броя на "близките" числа
counter = 0

for i in range(1, len(num_int_list)):
    if num_int_list[i] > num_int_list[i - 1]:
        counter += 1

# Принтиране на броя на "близките" числа
print(counter)
